title: Swedish Bank Phish
id: 3a8978e9-51f6-4b9f-9407-1ea94d330817
status: experimental
description: Domains containing Swedish bank names
author: DenizenB
references: []
date: 2022/10/05
tags: []
logsource:
  category: certificate
  product: certstream
detection:
  selection:
    leaf_cert.registered_domains|re: "(bankid|handelsbanken|swedbank|nordea|seb-|-seb|seblt|danskebank|sbab|skandiabanken|icabanken)\\b"
  condition: selection
fields:
  - leaf_cert.subject.CN
  - leaf_cert.all_domains
  - leaf_cert.issuer.O
falsepositives:
  - Yes
level: low
