title: Booking Phishlet
id: 3a8978e9-51f6-4b9f-9407-1ea94d330817
status: experimental
description: "Certificate matches Booking phishlet, landing page: {{leaf_cert.all_domains.0}}"
author: DenizenB
references:
  - https://github.com/kgretzky/evilginx2/tree/master/phishlets
date: 2022/10/05
tags: []
logsource:
  category: certificate
  product: certstream
detection:
  selection:
    leaf_cert.issuer.O: "Let's Encrypt"
    leaf_cert.all_domains.length: 8
    leaf_cert.all_domains|re|all:
      - "(^|,)accounts\\.booking\\."
      - "(^|,)account\\."
      - "(^|,)secure\\."
      - "(^|,)www\\."
      - "(^|,)join\\."
      - "(^|,)admin\\."
      - "(^|,)q\\."
      - "(^|,)r\\."
  condition: selection
fields:
  - leaf_cert.registered_domains
falsepositives:
  - Yes
level: high
