title: Coinbase Phishlet
id: 3a8978e9-51f6-4b9f-9407-1ea94d330817
status: experimental
description: Subdomains used by Evilginx2 phishlets
author: DenizenB
references:
  - https://github.com/kgretzky/evilginx2/tree/master/phishlets
date: 2022/10/05
tags: []
logsource:
  category: certificate
  product: certstream
detection:
  selection:
    leaf_cert.issuer.O: "Let's Encrypt"
    leaf_cert.all_domains.length: 12
    leaf_cert.all_domains|re|all:
      - "(^|,)www\\."
      - "(^|,)ws\\."
      - "(^|,)google\\."
      - "(^|,)googletag\\."
      - "(^|,)assets\\."
      - "(^|,)dynamic\\."
      - "(^|,)cdn\\."
      - "(^|,)sessions\\."
      - "(^|,)events\\."
      - "(^|,)exceptions\\."
      - "(^|,)images\\."
  condition: selection
fields:
  - leaf_cert.subject.CN
  - leaf_cert.all_domains
  - leaf_cert.issuer.O
falsepositives:
  - Yes
level: high
